if ($(window).width() > 680){
  let blocks = [
    ' <strong>УСЛУГА ДОЛЖНИКУ</strong>: <br>А. Подготовка и подача заявления о возбуждении дела о банкротстве. <br>Б. Комплексные услуги арбитражного управляющего. <br>В. Комплексное сопровождение дела в суде. <br>Г. Обжалование решений судов и действий участников дела о банкротстве. <br>Д. Подготовка плана санации (досудебная, судебная процедуры) и мировых соглашения в <br>рамках дела о банкротстве. <br>Е. Комплексный анализ финансового состояния должника. <br>Ж. Инвентаризация активов и обязательств. <br>З. Рассмотрение требований кредиторов и составления реестра требований. <br>И. Взаимодействие с распорядителем имущества, ликвидатором. <br>Й. Контроль процедуры продажи имущества должника, принятия участия в аукционах с целью выкупа имущества. <br>К. Решения любых других Ваших проблем в процедурах банкротства. <br><strong>УСЛУГА КРЕДИТОРУ:</strong> <br>Банкротство Вашего должника это последний шанс взыскать долг. В рамках оказания услуги мы: <br>А. Заявляем кредиторские требование и контролируем их признание. <br>Б. Занимаемся поиском имущества должника для удовлетворения Ваших требований. <br>В. Комплексно сопровождаем Вас в суде и коллегиальных органах должника. <br>Г. Контролируем деятельность арбитражного управляющего, при необходимости проводим смену арбитражного управляющего на своего. <br>Д. Полностью контролируем процесс продажи имущества должника и погашения Ваших требований. Обжалуем результаты аукциона. <br>Е. Проводим анализ плана санации и проэктов мировых соглашений на соответствие закону, исчисляем вероятность погашения Вашего долга. <br>Ж. Составляем план санации и мировые соглашения в рамках дела о банкротстве.',
    '<strong>Услуги:</strong><br>Решение споров связанных с заключением, изменением, расторжением хозяйственных договоров.<br> Решение споров о применении мер ответственности (взыскание неустойки, процентов, пени) и возмещении убытков и материального ущерба.<br> Взыскание долгов.<br> Решение споров о правах на недвижимое имущество. <br> Решение споров о признании договоров недействительными и применение последствий недействительности договоров.<br> Решение споров, связанных с уступкой прав требований и переводом долга.<br> Решение других споров, возникших между субъектами предпринимательской деятельности.',
    '<strong>Услуги:</strong><br>1. Переговоры с Банком: реструктуризация долга; подписание мировых соглашений с банками Украины. Если Вы или Ваша компания намерены продолжать хозяйственную деятельность, но мешают долги перед Банками, то Мы поможем Вам достигнуть компромисса на выгодных для Вас условиях, даже если Банк уже подал в суд или исполняет судебное решение через исполнителей. <br>2. ВОЗВРАЩЕНИЕ ДЕПОЗИТА С НЕПЛАТЕЖЕСПОСОБНЫХ БАНКОВ И РАЗРЕШЕНИЕ ИНЫХ ВИДОВ СПОРОВ. Массовое банкротство банков которое началось с 2013 года привело к тому что тысячи вкладчиков потеряли свои вклады. Мы поможем возвратить Вам максимально возможную сумму Ваших денег. Если у Вас есть долги перед такими банками, или Ваше имущество в залоге у неплатежеспособных банков, Мы поможем, с минимальными затратами, полностью аннулировать Ваши долги и возвратить имущество. <br>3. Признание кредитного договора и договоров залога недействительными. При реализации этой услуги мы используем тонкости законодательства которые при подписании договором не соблюдались сторонами. Это и есть основанием для признания договоров недействительными в судебном порядке. <br>4. Признание договора поручительства прекращенным. Практика и правовые позиции Верховного Суда, при существовании определенных обстоятельств, поддерживает кредиторов и позволяет добиться необходимого Вам результата.<br> 5. Применение cрoкa иcковой дaвнocти. Xoрoший apгумeнт в cпoрe c бaнкoм, пocкoльку oчень чaстo бaнк или кoллeктoрскaя фирмa пытaется пoлучить деньги строк исковой давности для взыскания которых истек.<br> 6. Признание незаконным повышение процентной ставки по кредитному договору. В период с 2009 гoдa ввeдeны ряд зaкoнoв Укрaины, кoтoрыe зaпрeщaют бaнкaм в oднoстoрoннeм пoрядкe пoвышaть прoцeнтную стaвку пo крeдитным договорам. <br>7. Избавление от пени и штрафных санкций. Банки в большинстве случаев насчитывают штрафы по кредитному договору незаконно. В судебном порядке, используя правовые инструменты, размеры штрафов можно уменьшить или избавится от них вообще, что доказано множеством выигранных судебных дел и практикой Верховного Суда.<br> 8. Комплексное сопровождение процедуры принудительного взыскания долга (исполнительное производство, банкротство), выкуп имущества с публичных торгов. Мы можем контролировать процедуры принудительного взыскания долга с Вас, которые происходят в рамках исполнительного производства или банкротства. Если Банк уже начал процедуру взыскания долга за счет Вашего залогового имущества, Мы поможем Вам выкупить его за минимально возможную сумму и при этом полностью аннулировать Ваш долг перед Банком.<br> 9. Снятие арестов с имущества. В случает наличия арестов после выполнения всех обязательств перед Банком, Мы снимем любые обременения в максимально короткий строк. <br>10. Соблюдение прав жильцов при выселении их из предмета ипотеки в судебном порядке по иску банка. Использование законных методов позволить остановить процедуру «изъятия» жилья, выселения Вас из ипотечного имущества, а также позволит оставить жилую недвижимость у Вашем владении.',
    '<strong>Услуги:</strong><br> Юридическая консультация по уголовным делам – в мельчайших деталях рассматриваются вопросы защиты от обвинений в совершении экономических и коррупционных преступлений, включая особенности их расследования. <br> Изучение всех материалов уголовного производства, оценка вероятности тех или иных будущих решений по делу, построение стратегии защиты. <br> Участие в суде, при избрании подзащитному меры пресечения (главная задача «оставить клиента на свободе»); обжалование, постановленных с очевидными нарушениями, решений следственного судьи об избрании меры пресечения и о назначении иных ограничительных мер (наложение ареста на имущество, временный доступ к вещам и документам и т.п.). <br> Отстаивание личных интересов клиента на всех этапах уголовного производства, независимо от статуса: защитник подозреваемого (с момента уведомления о подозрении), обвиняемого или, если дело в суде, то осуществляется защита подсудимого; помощь клиенту при его допросе в качестве свидетеля; представитель гражданского истца, потерпевшего. <br> Присутствие во всех, без исключения, процессуальных (следственных) действиях с непосредственным участием подзащитного: осмотре места происшествия, обыске, допросе, следственном эксперименте, вручении уведомления о подозрении и др. <br> Реагирование на факты фальсификации доказательств, подкупа свидетелей, незаконного влияния на экспертов. <br> Подготовка всех необходимых для защиты документов: жалоб следственному судье, ходатайств, заявлений в различные органы власти и т.д. <br> Подготовка жалоб на незаконные, по мнению защиты, постановления, действия/бездеятельность лиц уполномоченных вести уголовное производство (прокурора, следователя). <br> Обжалование всех, по мнению защиты, незаконных и подлежащих обжалованию определений вынесенных следственным судьёй. <br> Обжалование приговоров, постановленных, по мнению стороны защиты, с нарушениями, в апелляционном и кассационном суде. Обращение за защитой, после исчерпания всех национальных механизмов, в международные инстанции, одной из которых является Европейский суд по правам человека.',
    '<strong>Содержание услуги:</strong> <br>юридический аудит предприятий при сделках по слиянию или поглощению с подготовкой отчета <br>юридическом аудите (legal due diligence report); <br>диагностический юридический аудит; <br>подготовка компании к последующей продаже; <br>юридический аудит сделок; <br>юридический аудит земельных участков и объектов недвижимости; <br>подготовка договоров купли-продажи активов по итогам проведения юридического аудита; <br>сопровождение судебных споров, вытекающих из предоставления стороне по соглашению ложной информации в ходе проведения юридического аудита.',
    '<strong>Услуги:</strong><br>Консультации по вопросам наименования, местонахождение, размера уставного капитала, избрание соответствующих КВЭД и другие.<br> Подготовка документов (устав, протокол, приказ, заявление о государственной регистрации создания юридического лица). <br>Проведение государственной регистрации.<br> Подача документов в налоговую (регистрация плательщиком единого налога, регистрация плательщиком НДС). <br>Получение ключей ЭЦП (электронная цифровая подпись).<br> Сопровождение при открытии счета в банке с оформлением карточки с образцами подписей и оттиска печати у нотариуса.<br> Предоставление помощи в изготовлении печати, штампов. <br>Предоставление других услуг связанных с регистрацией физического лица- предпринимателя и юридического лица.'
  ];
  let slides = document.querySelectorAll('#slidet');
  if($(window).width() > 890){
    slides[0].classList.add('sl-active');
  }
  ad_info_txt.innerHTML = blocks[0];
  for( let i = 0; i<slides.length; i++){
    slides[i].onclick = function () {
      if ($(window).width() > 890) {
        for( let i = 0; i<slides.length; i++){
          slides[i].classList.remove('sl-active');
        }
        ad_info_txt.innerHTML = blocks[i];
        slides[i].classList.add('sl-active');
      }
    }
  }
}




menu_toggle.onclick = function () {
    menu_ul.classList.toggle("block");
    wrap2.classList.toggle("marg");
}

  var owl = $(' .news .owl-carousel');
  owl.owlCarousel({
      items:1,
      loop:true,
      margin:10,
      autoplay:true,
      autoplayTimeout:5000,
      autoplayHoverPause:true,
      dots: true,
      smartSpeed: 2000,
      dots: false
  });

  if ($(window).width() <= 890){
      dbl.classList.add('owl-carousel');
      var owl = $(' .wrap2 .owl-carousel').owlCarousel({
      loop: 'true',
      center: 'true',
      nav: false,
      dots: false,
      items: 1,
      responsive :{
        820:{
          stagePadding: 240,
          margin: 40
        },
        700: {
          stagePadding: 210,
          margin: 40
        },
        635:{
            stagePadding: 190,
            margin: 40
        },
        605:{
            stagePadding: 170,
            margin: 30
        },
        585:{
          stagePadding: 160,
          margin: 30
        },
        515:{
          stagePadding: 135,
          margin: 25
        },
        450:{
          stagePadding: 105,
          margin: 25
        },
        415:{
          stagePadding: 85,
          margin: 15
        },
        388:{
          stagePadding: 70,
          margin: 15
        },
        360:{
          stagePadding: 55,
          margin: 15
        },
        320:{
          stagePadding: 40,
          margin: 15
        }
      }
    });
  }


  let showMores = document.querySelectorAll('.show-more');
  let textList = document.querySelectorAll('.elipsis');
  let slides = document.querySelectorAll('.slide');
  
  for (let i = 0; i < showMores.length; i++){
    showMores[i].onclick = function(){
      if ( !slides[i].classList.contains("h-auto") ){
        showMores[i].innerHTML = 'скрыть текст';
        textList[i].style.height = 'auto';
        slides[i].classList.add("h-auto");
      } else {
        showMores[i].innerHTML = 'показать продолжение';
        textList[i].style.height = 78 + 'px';
        slides[i].classList.remove("h-auto");
      }
    }
  }
  
